Создать консольное приложение, удовлетворяющее следующим требованиям:

Использовать возможности ООП: классы, наследование, полиморфизм, инкапсуляция.
Каждый класс должен иметь исчерпывающее смысл название и информативный состав.
Наследование должно применяться только тогда, когда это имеет смысл.
При кодировании должны быть использованы соглашения об оформлении кода java code convention.
Классы должны быть грамотно разложены по пакетам.
Работа с консолью или консольное меню должно быть минимальным.
Для хранения параметров инициализации можно использовать файлы.


Страхование. Определить иерархию страховых обязательств. Собрать из обязательств дериватив.
Рассчитать стоимость. Провести сортировку обязательств в деривативе на основе уменьшения степени риска.
Найти обязательство в деривативе, соответствующее заданному диапазону параметров.
